Продолжаем вылизывать новую архитектуру LG V2
